#include <stdio.h>

int main()
{
  printf("Hello World!");
  return 0;
}
/*
บรรทัดที่ 1:
#include <stdio.h> เป็นไลบรารีไฟล์ส่วนหัวที่ให้เราทำงานกับฟังก์ชันอินพุตและเอาต์พุต เช่น printf()(ใช้ในบรรทัดที่ 4) ไฟล์ส่วนหัวเพิ่มฟังก์ชันการทำงานให้กับโปรแกรม C

บรรทัดที่ 3:
main(). สิ่งนี้เรียก ว่าฟังก์ชัน รหัสใดๆ ภายในวงเล็บปีกกา {} จะถูกดำเนินการ

บรรทัดที่ 4:
printf() เป็นฟังก์ชันที่ใช้ในการส่งออก/พิมพ์ข้อความไปยังหน้าจอ

โปรดทราบว่า:ทุกคำสั่ง C จะลงท้ายด้วยเครื่องหมายอัฒภาค;

บรรทัดที่ 5:
return 0สิ้นสุดmain()ฟังก์ชัน

บรรทัดที่ 6:
อย่าลืมเพิ่มวงเล็บปีกกาปิด } เพื่อสิ้นสุดฟังก์ชันหลัก
*/